---
kind: property
id: P:Autodesk.Revit.UI.Events.DisplayingOptionsDialogEventArgs.PagesCount
source: html/2978b833-933a-3f95-c91c-317b3f47612a.htm
---
# Autodesk.Revit.UI.Events.DisplayingOptionsDialogEventArgs.PagesCount Property

The count of pages in the options dialog (include the default pages added by Revit).

## Syntax (C#)
```csharp
public int PagesCount { get; }
```